In [1]:
#Q1.Combine two series into a DataFrame

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
s1 = pd.Series(['350', '280', 'great', '786.67', '1200'])
s2 = pd.Series(['learning', '45', 'numpy', '30.12', 'pandas'])

In [5]:
df = pd.concat([s1,s2], axis = 1)
df

        0         1
0     350  learning
1     280        45
2   great     numpy
3  786.67     30.12
4    1200    pandas

In [6]:
#Q2 Program to stack two given series vertically and horizontally.

In [7]:
series1 = pd.Series(range(10))
series2 = pd.Series(list('qwertyuiop'))

In [8]:
print(series1)
print(series2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64
0    q
1    w
2    e
3    r
4    t
5    y
6    u
7    i
8    o
9    p
dtype: object

In [9]:
pd.concat((series1,series2))

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
0    q
1    w
2    e
3    r
4    t
5    y
6    u
7    i
8    o
9    p
dtype: object

In [18]:
df = pd.concat((series1,series2), axis=1)
df

   0  1
0  0  q
1  1  w
2  2  e
3  3  r
4  4  t
5  5  y
6  6  u
7  7  i
8  8  o
9  9  p

In [11]:
series1.append(series2)

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
0    q
1    w
2    e
3    r
4    t
5    y
6    u
7    i
8    o
9    p
dtype: object

In [19]:
df

   0  1
0  0  q
1  1  w
2  2  e
3  3  r
4  4  t
5  5  y
6  6  u
7  7  i
8  8  o
9  9  p

In [ ]:
# Q3. Multiply every number of the dataset by 10.(use map and def/lambda)

In [15]:
def multiply(x):
    return x*10

In [16]:
df[0] = df[0].map(multiply)

In [21]:
df[0] = df[0].map(lambda x: x*10)

In [ ]:
# Q4.Create a function called greater that returns a boolean value to a new column called 'C3'
# (Consider greater to have numbers greater than 50)

In [23]:
#number>50 : true else false

In [24]:
def greater(x):
    if x>50:
        return True
    else:
        return False

In [25]:
df['C3'] = df[0].map(greater)   #mapping with the function defined

In [30]:
df['c3'] = df[0].map(lambda x : True if x>50 else False)   #mapping with lambda

In [28]:
df['c'] = df[0]>50   #using masking

In [29]:
df

    0  1     C3     c3      c
0   0  q  False  False  False
1  10  w  False  False  False
2  20  e  False  False  False
3  30  r  False  False  False
4  40  t  False  False  False
5  50  y  False  False  False
6  60  u   True   True   True
7  70  i   True   True   True
8  80  o   True   True   True
9  90  p   True   True   True

In [31]:
#Q5. Load the iris dataset from pandas

In [32]:
from sklearn.datasets import load_iris
iris = load_iris()

In [39]:
iris_df = pd.DataFrame(iris.data, columns = iris.feature_names)

In [40]:
iris_df.head()

   sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                5.1               3.5                1.4               0.2
1                4.9               3.0                1.4               0.2
2                4.7               3.2                1.3               0.2
3                4.6               3.1                1.5               0.2
4                5.0               3.6                1.4               0.2

In [44]:
#a) check if there are any null values

In [49]:
iris_df.isnull().sum()

sepal length (cm)    0
sepal width (cm)     0
petal length (cm)    0
petal width (cm)     0
dtype: int64

In [55]:
iris_df.notnull().sum()

sepal length (cm)    150
sepal width (cm)     150
petal length (cm)    150
petal width (cm)     150
dtype: int64

In [53]:
iris_df == np.nan

     sepal length (cm)  sepal width (cm)  petal length (cm)  petal width (cm)
0                False             False              False             False
1                False             False              False             False
2                False             False              False             False
3                False             False              False             False
4                False             False              False             False
..                 ...               ...                ...               ...
145              False             False              False             False
146              False             False              False             False
147              False             False              False             False
148              False             False              False             False
149              False             False              False             False

[150 rows x 4 columns]

In [58]:
iris_df.isnull().count()

sepal length (cm)    150
sepal width (cm)     150
petal length (cm)    150
petal width (cm)     150
dtype: int64

In [ ]:
# Lets set the values of the rows 10 to 29 of the column 'petal_length' to NaN

In [60]:
iris_df.iloc[10:30,2]= np.nan

In [62]:
iris_df.loc[10:29,'petal length (cm)']= np.nan

In [63]:
iris_df.isnull().sum()

sepal length (cm)     0
sepal width (cm)      0
petal length (cm)    20
petal width (cm)      0
dtype: int64

In [64]:
#c) Good, now lets substitute the NaN values to mean,, fillna

In [69]:
iris_df['petal length (cm)'].fillna(iris_df['petal length (cm)'].mean(),inplace=True)

In [71]:
# Q6) Use bfill() function to populate missing values in 'A' column na values in the dataframe across rows.

In [76]:
df = pd.DataFrame({"A":[None, 1, 2, 3, None, None], 
                   "B":[11, 5, None, None, None, 8], 
                   "C":[None, 5, 10, 11, None, 8]})

In [77]:
df

     A     B     C
0  NaN  11.0   NaN
1  1.0   5.0   5.0
2  2.0   NaN  10.0
3  3.0   NaN  11.0
4  NaN   NaN   NaN
5  NaN   8.0   8.0

In [100]:
df['A'].fillna(method = 'bfill',inplace=True)

In [79]:
df['C'].fillna(method = 'ffill')

0     NaN
1     5.0
2    10.0
3    11.0
4    11.0
5     8.0
Name: C, dtype: float64

In [81]:
# Use mode() function to populate missing values in 'B' column na values in the dataframe across rows.

In [82]:
df['C']= df['C'].fillna(11.0)
df

     A     B     C
0  NaN  11.0  11.0
1  1.0   5.0   5.0
2  2.0   NaN  10.0
3  3.0   NaN  11.0
4  NaN   NaN  11.0
5  NaN   8.0   8.0

In [97]:
df["B"].fillna(df["B"].mode()[2],inplace=True)

In [93]:
df['B'].mode()

0     5.0
1     8.0
2    11.0
dtype: float64

In [92]:
type(df['B'].median())

float

In [96]:
# Now we are going to replace the all Nan value in the data frame with -99 value using replace

In [101]:
df

     A     B     C
0  1.0  11.0  11.0
1  1.0   5.0   5.0
2  2.0  11.0  10.0
3  3.0  11.0  11.0
4  NaN  11.0  11.0
5  NaN   8.0   8.0

In [102]:
df= df.replace(to_replace = np.nan, value = -99) 
df

      A     B     C
0   1.0  11.0  11.0
1   1.0   5.0   5.0
2   2.0  11.0  10.0
3   3.0  11.0  11.0
4 -99.0  11.0  11.0
5 -99.0   8.0   8.0

In [103]:
df.fillna(-99)

      A     B     C
0   1.0  11.0  11.0
1   1.0   5.0   5.0
2   2.0  11.0  10.0
3   3.0  11.0  11.0
4 -99.0  11.0  11.0
5 -99.0   8.0   8.0

In [104]:
# Q10. Write a code to MERGE(outer) data1 & data2 as data.

In [105]:
data1 = pd.DataFrame({'EMP_ID': ['2101', '2102', '2103', '2104'],
                     'SALARY_YEAR1': ['1000', '2000', '3000', '4000'],
                     'SALARY_YEAR2': ['2000', '4000', '6000', '8000']})
   
data2 = pd.DataFrame({'EMP_ID': ['2101', '2106', '2103', '2104'],
                          'SALARY_YEAR3': ['3000', '6000', '12000', '16000'],
                          'SALARY_YEAR4': ['4000', '8000', '15000', '30000']})

In [106]:
dfc = pd.concat(objs=(data1,data2),axis=0,join='outer')

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

In [107]:
dfc

  EMP_ID SALARY_YEAR1 SALARY_YEAR2 SALARY_YEAR3 SALARY_YEAR4
0   2101         1000         2000          NaN          NaN
1   2102         2000         4000          NaN          NaN
2   2103         3000         6000          NaN          NaN
3   2104         4000         8000          NaN          NaN
0   2101          NaN          NaN         3000         4000
1   2106          NaN          NaN         6000         8000
2   2103          NaN          NaN        12000        15000
3   2104          NaN          NaN        16000        30000

In [108]:
dfc = pd.concat(objs=(data1,data2),axis=0,join='inner')

In [109]:
dfc

  EMP_ID
0   2101
1   2102
2   2103
3   2104
0   2101
1   2106
2   2103
3   2104